"""
    Скласти алгоритм програми, що реалізує переклад 
    із заданого способу матричного подання графа в інший.

    Створити програму, що реалізує переклад із заданого 
    способу матричного подання графа в іншій. Передбачити 
    консольне введення вхідних даних і висновок 
    результатів роботи програми на екран.
"""
"""
A - матриця суміжності
I - матриця інцидентності
"""
# Функція перекладу матриці суміжності в матрицю інцидентності
def A_to_I(inmatric = []):
    if inmatric == []: return []
    outmatric = inmatric
    
    
    
    return outmatric
# Функція перекладу матриці інцидентності в матрицю суміжності
def I_to_A(inmatric = []):
    if inmatric == []: return []
    outmatric = inmatric
    
    
    
    return outmatric
# Функція введення матриці
def MatricInit(outmatric = []):
    row_len = int(input('$ Введіть кількість [рядків]: '))
    for i in range (0, row_len):
        while True:
            inp = input(f'   $ Введіть {i + 1}-й рядок ["0101"]\n   $ ')  
            if outmatric != []:
                if len(inp) != len(outmatric[0]):
                    print('    ! Невірна кількість стовпців\n')
            outmatric.extend([[*inp]]); break; 
    return outmatric

# Створення та заповнення загальної матриці
# matric = MatricInit()

matric = [ 
[1, 0, 0, 0],          
[0, 1, 0, 0],
[0, 0, 1, 0],          
[0, 0, 0, 1],          
]

# Вивід матриці інцедентності, перекладеної з матриці суміжності
print('\n> Переклад суміжної в інцидентну:\n')
[print(i) for i in A_to_I(matric)]
# Вивід матриці суміжності, перекладеної з матриці інцидентності
print('\n> Переклад інцидентної в суміжну:\n')
[print(i) for i in I_to_A(matric)]
